add activity messaging: implement ActivityDeleteMessage and ActivityUpdateMessage classes, update RabbitMQ configuration, and modify ActivityMessListner for handling activity updates and deletions
